app/Soap/SoapResources/GetDoctorList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:GetDoctorList>
         <tem:idSpesiality/>
         <tem:idLpu/>
         <tem:idPat/>
         <tem:guid/>
         <tem:idHistory/>
      </tem:GetDoctorList>
   </soapenv:Body>
</soapenv:Envelope>